using System;

namespace Encapsulation
{
    class Program
    {
        static void Main(string[] args)
        {
            //Encapsulation - начина да си скрием имплементацията. Дава възможност за гъвкавост на кода, намалява сложността на кода, промените остават локални и ни позволяа да правим валидации. Идеята е да скрием сложната имплементация на нещо и да направим кода по-четим и по-лесен за поддръжка. Идеята е да скрием ненужна за външния свят информация, това на е сайбър секюрити (не е за да не ни хакнат)! Енкапсулация няма нищо общо със секюрити! 
              //Това с колата и енджина е пример за добра енкапсулация, защото портебителя има старт и стоп и не се интересува от сложността на енджина и тя не му се показва!!! Не е нужно да показваме на външния свят методи и пропъртита, които не го интересуват и само ще му усложнят живота! Така ако има нужда да променим нещо го правим локално в класа и не се налага да променяме на много места! 
              //Правим публични само необходими неща!
              //List<T> е добър пример за добра енкапсулация, дава ни само нужното за да работим с него и не ни занимава с това как работи (например вътрешния масив)!!!
             
            //factory design pattern - споменаха на упражнението да си погледнем!


        }
    }
}
