using System;

namespace Encapsulation
{
    class Program
    {
        static void Main(string[] args)
        {
            //Encapsulation - начина да си скрием имплементацията. Дава възможност за гъвкавост на кода, намалява сложността на кода, промените остават локални и ни позволяа да правим валидаии. Идеята е д скрием сложната имплементация на нещо и да направим кода по-четим и по-лесен за поддръжка. Идеята е да скрием ненужна за външния свят информация, това на е сайбър секюрити(не е за да не ни хакнат)! Енкапсулация няма нищо общо със секюрити!     
        }
    }
}
